#+title: Week 4

* Head of State
*64*

#+begin_src python :results output

class Edge:

    def __init__(self, fr, c, to):
        self.fr = fr
        self.c = chr(c)
        self.to = to

automata = [ Edge(1, 0x6B, 2),
             Edge(1, 0x68, 6),
             Edge(2, 0x6F, 3),
             Edge(2, 0x73, 7),
             Edge(3, 0x68, 2),
             Edge(3, 0x75, 7),
             Edge(4, 0x70, 3),
             Edge(4, 0x69, 5),
             Edge(4, 0x67, 0x0B),
             Edge(4, 0, 0),
             Edge(5, 0x61, 1),
             Edge(5, 0x66, 4),
             Edge(5, 0x6D, 6),
             Edge(5, 0, 0),
             Edge(6, 0x6F, 7),
             Edge(6, 0, 0),
             Edge(7, 0x6A, 8),
             Edge(7, 0, 0),
             Edge(8, 0x79, 5),
             Edge(8, 0x75, 7),
             Edge(8, 0, 0),
             Edge(0x0B, 0x65, 0x0C),
             Edge(0x0B, 0, 0),
             Edge(0x0C, 0x75, 0x0F),
             Edge(0x0D, 0x72, 0x0B),
             Edge(0x0D, 0x6B, 0x0C),
             Edge(0x0D, 0x6D, 0x0E),
             Edge(0x0D, 0x76, 0x13),
             Edge(0x0D, 0, 0),
             Edge(0x0E, 0x73, 0x0B),
             Edge(0x0F, 0x66, 0x0D),
             Edge(0x0F, 0x63, 0x0E),
             Edge(0x10, 0x7A, 0x11),
             Edge(0x10, 0x6C, 0x12),
             Edge(0x10, 0, 0),
             Edge(0x11, 0x70, 0x12),
             Edge(0x11, 0x61, 0x14),
             Edge(0x12, 0x66, 0x13),
             Edge(0x12, 0x68, 0x15),
             Edge(0x12, 0x6A, 0x18),
             Edge(0x12, 0, 0),
             Edge(0x13, 0x6F, 0x10),
             Edge(0x14, 0x6E, 0x12),
             Edge(0x14, 0x62, 0x15),
             Edge(0x15, 0x65, 0x13),
             Edge(0x16, 0x6D, 0x17),
             Edge(0x17, 0x71, 0x16),
             Edge(0x17, 0x6A, 0x1A),
             Edge(0x17, 0, 0),
             Edge(0x18, 0x65, 0x16),
             Edge(0x19, 0x77, 0x16),
             Edge(0x19, 0x6B, 0x18),
             Edge(0x19, 0x6E, 0x1A),
             Edge(0x19, 0x74, 0x65),
             Edge(0x1A, 0x72, 0x1B),
             Edge(0x1A, 0, 0),
             Edge(0x1B, 0x7A, 0x19),
             Edge(0x1B, 0x6F, 0x1A),
             Edge(0x65, 0x65, 0x68),
             Edge(0x65, 0x7A, 0x6A),
             Edge(0x65, 0x75, 0x6B),
             Edge(0x65, 0x6C, 0x6F),
             Edge(0x65, 0, 0),
             Edge(0x66, 0x64, 0x67),
             Edge(0x66, 0x7A, 0x539),
             Edge(0x66, 0, 0),
             Edge(0x67, 0x6C, 0x539),
             Edge(0x67, 0, 0),
             Edge(0x68, 0x6A, 0x69),
             Edge(0x68, 0, 0),
             Edge(0x69, 0x6E, 0x69),
             Edge(0x69, 0x68, 0x6B),
             Edge(0x69, 0x74, 0x6F),
             Edge(0x69, 0, 0),
             Edge(0x6A, 0x6F, 0x6B),
             Edge(0x6A, 0x78, 0x6C),
             Edge(0x6A, 0x6D, 0x6E),
             Edge(0x6A, 0, 0),
             Edge(0x6B, 0x72, 0x6F),
             Edge(0x6C, 0x67, 0x6D),
             Edge(0x6C, 0x62, 0x70),
             Edge(0x6D, 0x6F, 0x70),
             Edge(0x6E, 0x71, 0x70),
             Edge(0x6E, 0x78, 0x73),
             Edge(0x6E, 0x68, 0x78),
             Edge(0x6E, 0, 0),
             Edge(0x6F, 0x6B, 0x69),
             Edge(0x70, 0x6F, 0x75),
             Edge(0x71, 0x69, 0x77),
             Edge(0x71, 0x67, 0x78),
             Edge(0x72, 0x6E, 0x67),
             Edge(0x72, 0x79, 0x73),
             Edge(0x72, 0x65, 0x74),
             Edge(0x72, 0x70, 0x76),
             Edge(0x72, 0, 0),
             Edge(0x73, 0x6D, 0x74),
             Edge(0x73, 0x77, 0x76),
             Edge(0x74, 0x6E, 0x74),
             Edge(0x75, 0x6C, 0x6D),
             Edge(0x76, 0x71, 0x72),
             Edge(0x77, 0x64, 0x71),
             Edge(0x77, 0x69, 0x78),
             Edge(0x77, 0, 0),
             Edge(0x78, 0x69, 0x6B),
             Edge(0x78, 0x6B, 0x71),
             Edge(0x78, 0x73, 0x77),
             Edge(0x78, 0, 0) ]

was = set()

def dfs(u, s):
    if u in was:
        return
    if u == 1:
        print(s)
        return
    was.add(u)
    for e in automata:
        if e.to == u:
            dfs(e.fr, e.c + s)

dfs(1337, '')
#+end_src

#+RESULTS:
: ksjyfgeufvoljemjrztzmxwqnl
: hojyfgeufvoljemjrztzmxwqnl

* what
*64*

#+begin_src python :results output
print(bytes.fromhex(hex(1633837924)[2:])[::-1])
#+end_src

#+RESULTS:
: b'dcba'

flag_cafe_0129837465dcba

* MadhuFarai
*PE*

#+begin_src python :results output
ps = [ (4, 4),
       (4, 4),
       (-4395, 4),
       (4, -4) ]

prevX = 0
prevY = 0
res = 0
for (i, p) in enumerate(ps[::-1]):
    if i % 2 == 0:
        t = (p[0]*prevX + p[1]*prevY)
        if t < 0:
            res += -((-t) % 32000)
        else:
            res += t % 32000
    prevX = p[0]
    prevY = p[1]

print(res)
#+end_src

#+RESULTS:
: -17564

* Shmalidator
*64*

#+begin_src python :results output
def dec(n):
    return bytes.fromhex(hex(n)[2:])[::-1]
res = dec(1496658995) + dec(1262695504) + dec(809972033)
print(res)
#+end_src

#+RESULTS:
: b'345YP4CKA1G0'
* JoeFain
*PE*

#+begin_src python :results output
def f1(Re, Im):
    return Re * Re - Im * Im - 1 + -5 * Re - 6 * Im
def f2(Re, Im):
    return 6 * Re - 5 * Im + 2 * Re * Im - 9

for Re in range(-1000, 1000):
    for Im in range(-1000, 1000):
        if f1(Re, Im) == 0 and f2(Re, Im) == 0:
            print(Re, Im)
#+end_src

#+RESULTS:
: 1 -1
: 4 -5
